test/artillery/stock-changeloca.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:3000/warehouse
  phases:
    - duration: 15
      arrivalRate: 1
      rampTo: 1
      name: "Case: 1 virtual users to 10 in 15 seconds"
scenarios:
  - flow:
    - loop:
      - log: "Change location stock"
      - post: 
          url: "/stock/change-location"
          json: [
            {
              id: 1,
              location_id: 1,
              version: 0
            },
            {
              id: 2
            }
          ]
      - post: 
          url: "/stock/change-location"
          json: [
            {
              id: 1,
              location_id: 2,
              version: 0
            },
            {
              id: 1
            }
          ]
      count: 2

# artillery run ./test/artillery/stock-changeloca.yml